export enum ReducerNameSpaces {
  states = 'STATES',
  data = 'DATA'
}

export enum ProductType { //Коллекционная┃Моментальная┃Цифровая┃Плёночная
  'Коллекционная' = 'Коллекционная',
  'Моментальная' = 'Моментальная',
  'Цифровая' = 'Цифровая',
  'Плёночная' = 'Плёночная'
}

export enum ProductCategory { //Видеокамера┃Фотоаппарат
  'Видеокамера' = 'Видеокамера',
  'Фотоаппарат' = 'Фотоаппарат'
}

export enum ProductLevel { //Нулевой┃Любительский┃Профессиональный
  'Нулевой' = 'Нулевой',
  'Любительский' = 'Любительский',
  'Профессиональный' = 'Профессиональный'
}

